#+title:  General Org-Mode Configuration
#+author: Howard X. Abrams
#+date:   2020-09-18
#+tags: emacs org
#+startup: inlineimages
#+lastmod: [2024-11-22 Fri]

A literate programming file for configuring org-mode and those files.

#+begin_src emacs-lisp :exports none
  ;;; ha --- Org configuration. -*- lexical-binding: t; -*-
  ;;
  ;; © 2020-2023 Howard X. Abrams
  ;;   Licensed under a Creative Commons Attribution 4.0 International License.
  ;;   See http://creativecommons.org/licenses/by/4.0/
  ;;
  ;; Author: Howard X. Abrams <http://gitlab.com/howardabrams>
  ;; Maintainer: Howard X. Abrams
  ;; Created: September 18, 2020
  ;;
  ;; This file is not part of GNU Emacs.
  ;;
  ;; *NB:* Do not edit this file. Instead, edit the original literate file at:
  ;;            ~/other/hamacs/ha-org.org
  ;;       And tangle the file to recreate this one.
  ;;
  ;;; Code:

#+end_src
** Searching
Came up with a great way to search a project for Org-specific files, and wrote [[https://howardism.org/Technical/Emacs/org-find-file.html][an essay]] describing the approach and the code. The idea is that I can call =find-file=, but the list of files is not only the filename, but the Org =#+title:= as well as any tags located in the file.

#+begin_src emacs-lisp
  (use-package org-find-file
    :straight nil
    :config
    (ha-leader "f o" '("load org" . org-find-file)))
#+end_src

Now that my paragraphs in an org file are on a single line, I could use =rg= (or some other =grep= program), but being able to use an /indexed search system/, like [[https://ss64.com/osx/mdfind.html][mdfind]] on Macos, or [[https://www.lesbonscomptes.com/recoll/][recoll]] on Linux, gives better results than line-oriented search systems.

While =mdfind= is builtin to MacOS, we need to install =recoll=:

#+BEGIN_SRC sh
  sudo apt install -y recoll
#+END_SRC

Let’s create operating-system functions the command line for searching:

#+begin_src emacs-lisp
  (defun ha-search-notes--macos (phrase path)
    "Return the indexed search system command on MACOS, mdfind.
  Including the parameters using the PHRASE on the PATH(s)."
    (let ((paths (if (listp path)
                     (mapconcat (lambda (p) (concat "-onlyin " p)) path " ")
                   (concat "-onlyin " path))))
      (format "mdfind %s -interpret %s" paths phrase)))

  (defun ha-search-notes--linux (phrase path)
    "Return the indexed search system command on Linux, recoll.
  Including the parameters using the PHRASE on the PATH(s)."
      (format "recoll -t -a -b %s" phrase))
#+end_src

And let’s see how that works:
#+begin_src emacs-lisp :tangle no :results replace
  (ha-search-notes--macos "crossway stream" "~/Notes")
#+end_src

This function calls the above-mentioned operating-system-specific functions, but returns the matching files as a /single string/ (where single quotes wrap each file, and all joined together, separated by spaces). This function also allows me to /not-match/ backup files and whatnot.
#+begin_src emacs-lisp
  (defun ha-search-notes--files (phrase path)
    "Return an escaped string of all files matching PHRASE.
  On a Mac, the PATH limits the scope of the search."
    (let ((command (if (ha-running-on-macos?)
                       (ha-search-notes--macos phrase path)
                     (ha-search-notes--linux phrase path))))
      (->> command
           (shell-command-to-list)
           (--remove (s-matches? "~$" it))
           (--remove (s-matches? "#" it))
           (--map (format "'%s'" it))
           (s-join " "))))
#+end_src
Let’s see it in action:
#+begin_src emacs-lisp :tangle no :results replace
  (ha-search-notes--files "bread" '("~/personal"))
#+end_src

#+RESULTS:
: ':3:common/rclinit.cpp:391::Recoll 1.36.1 + Xapian 1.4.22 [/home/howard/.recoll]'

Returns this string:
#+begin_example
 "'/Users/howard.abrams/Notes/Sprint-2022-25.org' '/Users/howard.abrams/Notes/Sprint-2022-03.org' '/Users/howard.abrams/Notes/Sprint-2020-45.org' '/Users/howard.abrams/Notes/Sprint-2022-09.org' '/Users/howard.abrams/Notes/Sprint-2022-05.org' '/Users/howard.abrams/Notes/Sprint-2022-01.org' '/Users/howard.abrams/Notes/Sprint-2022-19.org'"
#+end_example

The =ha-search-notes= function prompts for the phrase to search, and then searches through the =org-directory= path, acquiring matching files, to feed to =grep= (and the [[help:grep][grep function]]) to display a list of matches that I can jump to.

#+begin_src emacs-lisp
  (defun ha-search-notes (phrase &optional path)
    "Search files in PATH for PHRASE and display in a grep mode buffer."
    (interactive "sSearch notes for: ")
    (let* ((command   (if (ha-running-on-macos?) "ggrep" "grep"))
           (regexp    (string-replace " " "\\|" phrase))
           (use-paths (or path (list org-directory org-journal-dir)))
           (files     (ha-search-notes--files phrase use-paths))
           (cmd-line  (format "%s -ni -m 1 '%s' %s" command regexp files)))
      (grep cmd-line)))
#+end_src

Add a keybinding to the function:
#+begin_src emacs-lisp
  (ha-leader "f n" '("find notes" . ha-search-notes))
#+end_src
** Focused Work
:LOGBOOK:
CLOCK: [2022-02-11 Fri 11:05]--[2022-02-11 Fri 11:21] =>  0:16
:END:
I've been working on my own [[http://www.howardism.org/Technical/Emacs/focused-work.html][approach to focused work]],

#+begin_src emacs-lisp
  (use-package async)

  (use-package ha-focus
    :straight (:type built-in)
    :config
    (ha-leader
     "o f" '("begin focus" . ha-focus-begin)
     "o F" '("break focus" . ha-focus-break))
    :bind
    (("<f12>" . ha-focus-begin)
     ("S-<f12>" . ha-focus-interrupt)
     ("s-<f12>" . ha-focus-timer-left)))
#+end_src
